Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The y coordinate of the bottom of the healthbar
zh_cn: 健康栏底部的y坐标

source: The y coordinate of the bottom of the highscore rectangle.
zh_cn: 高分矩形底部的y坐标。

source: The y coordinate of the bottom of the rectangle.
zh_cn: 矩形底部的y坐标。

source: The y coordinate of the bottom of the region.
zh_cn: 区域底部的y坐标。

source: The y coordinate of the bottom of the rounded rectangle.
zh_cn: 圆角矩形底部的y坐标。

source: The y coordinate of the bottom right corner of the rectangle.
zh_cn: 矩形右下角的y坐标。

source: The y coordinate of the bottom right corner of the rounded rectangle (as if it were a normal rectangle).
zh_cn: 圆角矩形的右下角的y坐标(就像一个普通矩形一样)。

source: The y coordinate of the bottom side of the destination rectangle to check against.
zh_cn: 要检查的目标矩形底边的y坐标。

source: The y coordinate of the bottom side of the ellipse to check.
zh_cn: 要检查的椭圆底部的y坐标。

source: The y coordinate of the bottom side of the rectangle to check.
zh_cn: 要检查的矩形底边的y坐标。

source: The y coordinate of the bottom side of the source rectangle.
zh_cn: 源矩形底边的y坐标。

source: The y coordinate of the center of the circle to check.
zh_cn: 要检查的圆心的y坐标。

source: The y coordinate of the center of the circle.
zh_cn: 圆心的y坐标。

source: The y coordinate of the centre of the circle.
zh_cn: 圆心的y坐标。

source: The y coordinate of the circle centre.
zh_cn: 圆心的y坐标。

source: The y coordinate of the drawn string.
zh_cn: 所绘制字符串的y坐标。

source: The y coordinate of the end of the line (where the arrowhead ends).
zh_cn: 直线末端的y坐标(箭头结束的地方)。

source: The y coordinate of the end of the line.
zh_cn: 线条终点的y坐标。

source: The y coordinate of the first anchor point of the joint in the room
zh_cn: 关节在房间内的第一个锚点的y坐标

source: The y coordinate of the first component of the vector
zh_cn: 向量第一个分量的y坐标

source: The y coordinate of the first corner of the triangle to check.
zh_cn: 要检查的三角形第一个角的y坐标。

source: The y coordinate of the first side of the triangle to check.
zh_cn: 要检查的三角形第一条边的y坐标。

source: The y coordinate of the first vector.
zh_cn: 第一个向量的y坐标。

source: The y coordinate of the grid to check.
zh_cn: 要检查的网格的y坐标。

source: The y coordinate of the new point.
zh_cn: 新点的 y 坐标。

source: The y coordinate of the origin, relative to the sprite's top left corner.
zh_cn: 原点的y坐标，相对于sprite的左上角。

source: The y coordinate of the pixel to check
zh_cn: 要检查的像素的y坐标

source: The y coordinate of the point to be drawn.
zh_cn: 待画点的y坐标。

source: The y coordinate of the point to check.
zh_cn: 要检查的点的y坐标。

source: The y coordinate of the point.
zh_cn: 点的y坐标。

source: The y coordinate of the position to look from.
zh_cn: 观察位置的y坐标。

source: The y coordinate of the position to look to.
zh_cn: 要查看的位置的y坐标。

source: The y coordinate of the second anchor point of the joint in the room
zh_cn: 房间内关节的第二个锚点的y坐标

source: The y coordinate of the second component of the vector
zh_cn: 向量第二个分量的y坐标

source: The y coordinate of the second corner of the triangle to check.
zh_cn: 要检查的三角形第二个角的y坐标。

source: The y coordinate of the second side of the triangle to check.
zh_cn: 要检查的三角形第二条边的y坐标。

source: The y coordinate of the second vector.
zh_cn: 第二个向量的y坐标。

source: The y coordinate of the start of the line.
zh_cn: 直线起点的y坐标。

source: The y coordinate of the third corner of the triangle to check.
zh_cn: 要检查的三角形第三个角的y坐标。

source: The y coordinate of the third side of the triangle to check.
zh_cn: 要检查的三角形第三条边的y坐标。

source: The y coordinate of the top left corner of the area of the screen to capture
zh_cn: 要捕获的屏幕区域左上角的y坐标

source: The y coordinate of the top left corner of the rectangle.
zh_cn: 矩形左上角的y坐标。

source: The y coordinate of the top left corner of the rounded rectangle (as if it were a normal rectangle).
zh_cn: 圆角矩形的左上角的y坐标(就像一个普通矩形一样)。

source: The y coordinate of the top of the button
zh_cn: 按钮顶部的y坐标

source: The y coordinate of the top of the ellipse.
zh_cn: 椭圆顶部的y坐标。

source: The y coordinate of the top of the healthbar
zh_cn: 健康栏顶部的y坐标

source: The y coordinate of the top of the highscore rectangle.
zh_cn: 高分矩形顶部的y坐标。

source: The y coordinate of the top of the rectangle.
zh_cn: 矩形顶部的y坐标。

source: The y coordinate of the top of the rectangular region to activate.
zh_cn: 要激活的矩形区域顶部的y坐标。

source: The y coordinate of the top of the rectangular region to deactivate.
zh_cn: 要激活的矩形区域顶部的 y坐标

source: The y coordinate of the top of the region.
zh_cn: 区域顶部的y坐标。

source: The y coordinate of the top of the rounded rectangle.
zh_cn: 圆角矩形顶部的y坐标。

source: The y coordinate of the top side of the destination rectangle to check against.
zh_cn: 要检查的目标矩形顶边的y坐标。

source: The y coordinate of the top side of the ellipse to check.
zh_cn: 要检查的椭圆顶部的y坐标。

source: The y coordinate of the top side of the rectangle to check.
zh_cn: 要检查的矩形顶边的y坐标。

source: The y coordinate of the top side of the source rectangle.
zh_cn: 源矩形顶边的y坐标。

source: The y coordinate of the triangle's first corner.
zh_cn: 三角形第一个角的y坐标。

source: The y coordinate of the triangle's second corner.
zh_cn: 三角形第二个角的y坐标。

source: The y coordinate of the triangle's third corner.
zh_cn: 三角形第三个角的y坐标。

source: The y coordinate of the vertex.
zh_cn: 顶点的y坐标。

source: The y coordinate of where the path is drawn
zh_cn: 路径绘制位置的y坐标

source: The y coordinate of where to change colliding instances.
zh_cn: 要更改碰撞实例的位置的y坐标。

source: The y coordinate of where to create the particles.
zh_cn: 创建粒子的位置的y坐标。

source: The y coordinate of where to destroy colliding instances.
zh_cn: 销毁碰撞实例的y坐标。

source: The y coordinate of where to draw the sprite.
zh_cn: 绘制精灵的y坐标。

source: The y coordinate of where to draw the surface.
zh_cn: 绘制表面位置的y坐标。

source: The y coordinate of where to position the window.
zh_cn: 窗口位置的y坐标。

source: The y coordinate relative to the origin where the force will be applied
zh_cn: 相对于将应用力的原点的y坐标

source: The y coordinate relative to the origin where the impulse will be applied
zh_cn: 相对于将应用脉冲的原点的y坐标

source: The y coordinate to calculate.
zh_cn: 要计算的y坐标。

source: The y coordinate where the first part of the joint is anchored, within the game world
zh_cn: 在游戏世界中，关节的第一部分被锚定的y坐标

source: The y coordinate where the joint is anchored, within the game world
zh_cn: 在游戏世界中，关节锚定的y坐标

source: The y coordinate where the second part of the joint is anchored, within the game world
zh_cn: 在游戏世界中，关节的第二部分被锚定的y坐标

source: The y coordinate within the texture.
zh_cn: 纹理中的y坐标。

source: The y look vector (default 0).
zh_cn: y 轴的观察向量(默认为0)。

source: The y offset position for drawing.
zh_cn: 用于绘图的y偏移位置。

source: The y origin for the image being used.
zh_cn: 正在使用的图像的y原点。

source: The y position (in the room)
zh_cn: y 轴的位置(在房间内)

source: The y position (within the room) of the top of the area the camera view captures.
zh_cn: 相机视图捕捉的区域顶部的y位置(在房间内)。

source: The y position for the sprite
zh_cn: 精灵的y位置

source: The y position for the tile map
zh_cn: tile map的y位置

source: The y position in the room for the point.
zh_cn: 点在房间中的y位置。

source: The y position in the room to check
zh_cn: 要检查的房间中的y位置

source: The y position in the room to check.
zh_cn: 要检查的房间中的y位置。

source: The y position in the room to create the sequence at
zh_cn: 房间中要创建序列的y位置

source: The y position in the room to set the layer to
zh_cn: 房间中要设置图层的y位置

source: The y position in the source surface to copy from.
zh_cn: 要复制的源表面中的y位置。

source: The y position of the bottom of the region in the grid, from 0 to (grid height - 1)
zh_cn: 网格中区域底部的y位置，从0到(网格高度- 1)

source: The y position of the bottom of the region in the grid, from 0 to (grid height - 1).
zh_cn: 网格中区域底部的y位置，从0到(网格高度- 1)。

source: The y position of the bottom of the region in the grid.
zh_cn: 在网格中区域底部的位置。

source: The y position of the cell in the grid.
zh_cn: 单元格在网格中的y位置。

source: The y position of the cell to set.
zh_cn: 要设置的单元格的y位置。

source: The y position of the cell you want to find the value of.
zh_cn: 你想要求值的单元格的y位置。

source: The y position of the center of the area to delete.
zh_cn: 要删除的区域中心的y位置。

source: The y position of the disk center in the grid.
zh_cn: 圆盘中心在网格中的位置。

source: The y position of the disk on the grid.
zh_cn: 圆盘在网格上的y位置。

source: The y position of the light
zh_cn: 灯光的y位置

source: The y position of the listener (default 0).
zh_cn: 的y位置(默认为0)。

source: The y position of the new instance.
zh_cn: 新实例的y位置。

source: The y position of the origin.
zh_cn: 原点的y位置。

source: The y position of the point to move towards.
zh_cn: 要移向的点的y位置。

source: The y position of the tile map in the room
zh_cn: 房间中tile map的 y 位置

source: The y position of the top of the region in the grid, from 0 to (grid height - 1).
zh_cn: 网格中区域顶部的y位置，从0到(网格高度- 1)。

source: The y position of the top of the region in the grid.
zh_cn: 网格中区域顶部的位置。

source: The y position of the view port in the room
zh_cn: 房间中视窗的y位置

source: The y position of where to draw the surface.
zh_cn: 绘制表面的y位置。

source: The y position on the destination grid to add the source region to.
zh_cn: 目标网格上要添加源区域的位置。

source: The y position on the destination grid to copy the source region to.
zh_cn: 要将源区域复制到的目标网格上的y位置。

source: The y position on the destination grid to multiply the source region with.
zh_cn: 目标网格上的y位置，用来与源区域相乘。

source: The y position on the sprite of the top left corner of the area to draw.
zh_cn: 在精灵左上角的位置绘制区域。。

source: The y position on the surface from which to get the pixel.
zh_cn: 在表面上获取像素的y位置。

source: The y position the object will be created at
zh_cn: 创建对象的 y 位置

source: The y position to check for instances far from.
zh_cn: 要检查远离的实例的y位置。

source: The y position to check for instances.
zh_cn: 要检查实例的 y 位置。

source: The y position to check from.
zh_cn: 要检查的 y 位置。

source: The y position to check.
zh_cn: 要检查的y位置。

source: The y position to copy from.
zh_cn: 要复制的y位置。

source: The y position to copy to.
zh_cn: 要复制到的y位置。

source: The y position to create the particle at.
zh_cn: 创建粒子的y位置。

source: The y position to create the particle group at.
zh_cn: 创建粒子组的y位置。

source: The y position to place the view at (in the room)
zh_cn: 放置视图的y位置(在房间中)

source: The y position to use
zh_cn: 要使用的 y 坐标

source: The y position within the room to draw at
zh_cn: 要绘制的房间内的y位置

source: The y position within the room to use for getting the cell
zh_cn: 房间内用于获取单元格的y位置

source: The y position within the window.
zh_cn: 窗口内的y位置。

source: The y position.
zh_cn: y坐标。

source: The y positioning of the effect if relevant.
zh_cn: 相关效果的y位置。

source: The y scale amount.
zh_cn: y轴缩放值。

source: The y up vector (default 1).
zh_cn: y 轴向上向量(默认值为1)。

source: The y value of an instance is the vertical position in the current room, measured in pixels.
zh_cn: 实例的y值是当前房间中的垂直位置，以像素为单位。

source: The y vector value (default 0).
zh_cn: y 向量值(默认为0)。

source: The y velocity component of the listener (default 0).
zh_cn: 侦听器的y速度分量(默认为0)。

source: The y velocity of the listener (default 0).
zh_cn: 侦听器的y速率(默认为0)。

source: The year to check.
zh_cn: 要检查的年份。

source: The year to set.
zh_cn: 要设置的年份。

source: The yscale value (default is 1)
zh_cn: y 轴缩放值(默认值为1)

source: The z component of the light vector
zh_cn: 灯光向量的z分量

source: The z component of the surface normal.
zh_cn: 表面法线的z分量。

source: The z component of the transform vector
zh_cn: 变换向量的z分量

source: The z component of the translation vector.
zh_cn: 平移向量的z分量。

source: The z coordinate of the "up" vector.
zh_cn: "上"向量的z坐标。

source: The z coordinate of the first component of the vector
zh_cn: 向量第一个分量的z坐标

source: The z coordinate of the first vector.
zh_cn: 第一个向量的z坐标。

source: The z coordinate of the position to look from.
zh_cn: 观察位置的z坐标。

source: The z coordinate of the position to look to.
zh_cn: 要查看的位置的z坐标。

source: The z coordinate of the second component of the vector
zh_cn: 向量第二个分量的z坐标

source: The z coordinate of the second vector.
zh_cn: 第二个向量的z坐标。

source: The z look vector (default -1).
zh_cn: z 观察向量(默认为-1)。

source: The z look vector (default 1000).
zh_cn: z 轴的观察向量(默认为1000)。

source: The z position of the light
zh_cn: 灯光的z位置

source: The z position of the listener (default 0).
zh_cn: 的z位置(默认为0)。

source: The z position.
zh_cn: z坐标。

source: The z scale amount.
zh_cn: z轴缩放值。

source: The z up vector (default 0).
zh_cn: z 轴向上向量(默认值为0)。

source: The z vector value (default 0).
zh_cn: z 向量值(默认为0)。

source: The z velocity component of the listener (default 0).
zh_cn: 侦听器的z速度分量(默认为0)。

source: The z velocity of the listener (default 0).
zh_cn: 侦听器的z速率(默认为0)。

source: The zip file to open
zh_cn: 要打开的zip文件

source: Then you give the radius (as an integer value) around the center cell to search, before supplying the value to search for.
zh_cn: 然后，在提供要搜索的值之前，给出要搜索的中心单元格周围的半径(作为一个整数值)。

source: There are 6 types of primitives you can define with the following constants:
zh_cn: 您可以使用以下常量定义6种图元类型:

source: There are a number of constants that can be used in this function and they can be found here: Physics Joint Constants, but be aware that complex calculations are done when you call these, so they should be used with care and only when necessary and note that many are unique to a specific type of joint.
zh_cn: 物理关节常量，但注意，当你调用这些时，会进行复杂的计算，所以应该小心使用，只有在必要时，并注意，许多是特定类型的关节独有的。

source: There are a number of constants that can be used in this function and they can be found here: Physics Joint Constants.
zh_cn: 在此函数中可以使用许多常量，可以在这里找到:物理关节常量。

source: There are a number of ways that this can be avoided, for example using distance_to_point() to see how far from the specified location the instance is before moving.
zh_cn: 有许多方法可以避免这种情况，例如使用distance_to_point()来查看实例在移动之前离指定位置有多远。

source: There are many options here which allow complete simulation of all possible events, but note that this literally just performs all the code in the event and the game will not modify anything to make it trigger itself manually, for example if you choose to perform a keyboard press event, the event will be triggered but relevant key will not be recognised as having been pressed.
zh_cn: 这里有许多允许完全模拟所有可能事件的选项，但注意，这只是执行事件中的所有代码，游戏不会修改任何内容来手动触发它自己，例如，如果你选择执行一个键盘按下事件，事件将被触发，但相关的按键不会被识别为被按下。

source: There are many options here which allow complete simulation of all possible events, but note that this literally just performs all the code in the event and the game will not modify anything to make it trigger itself manually, for example if you choose to perform a keyboard press event, the event will be triggered but the relevant key will not be recognised as having been pressed.
zh_cn: 这里有许多选项，可以完全模拟所有可能的事件，但注意，这只是执行事件中的所有代码，游戏不会修改任何东西来手动触发它，例如，如果您选择执行键盘按下事件，事件将被触发，但相关的键不会被识别为已被按下。

source: There are twelve alarms built into each instance of an object, and each one has its own event that will run when this variable reaches 0.
zh_cn: 在对象的每个实例中内置了12个警报，每个警报都有自己的事件，当该变量达到0时将运行该事件。

source: There is also no need to call the part_emitter_destroy() function as this is taken care of automatically too.
zh_cn: 也不需要调用part_emitter_destroy()函数，因为这也是自动处理的。

source: There is no need to check the value to see if it is high enough to enter into the score list as GameMaker will only store those values that are greater than the tenth position stored.
zh_cn: 没有必要检查该值是否足够高以进入分数列表，因为GameMaker只会存储那些大于第十位的值。

source: There will be certain instances in a physics based game which you want to move around but do not wish to be acted on by forces such as gravity, nor forces incurred by collisions with dynamic objects (think of moving platforms in a platform game, for example).
zh_cn: 在基于物理的游戏中，会有某些情况，你想四处移动，但不希望受到重力等力的作用，也不希望受到与动态对象碰撞产生的力的作用(例如，想想平台游戏中的移动平台)。

source: Therefore GameMaker has to temporarily save a blended copy of the image and load it in.
zh_cn: 因此GameMaker必须临时保存图像的混合副本并将其加载。

source: Therefore GameMaker has to temporarily save a blended copy of the images and load them in when needed.
zh_cn: 因此GameMaker必须临时保存图像的混合副本，并在需要时加载它们。

source: Therefore the variable delta_time can be used to calculate how much faster (for example) a game character has to move to make up for a lag spike in the game.
zh_cn: 因此，变量delta_time可以用来计算游戏角色需要移动多快才能弥补游戏中的延迟高峰。

source: Therefore you should always call this function after you have found the files you require to "close" these handles.
zh_cn: 因此，您应该总是在找到所需的文件后调用此函数来"关闭"这些句柄。

source: These are explained below for each command.
zh_cn: 下面将对每个命令进行解释。

source: These are simply images (sprites) that are separate from the animation but when attached will move along with the bone they are attached to.
zh_cn: 这些只是从动画中分离出来的图像(精灵)，但当它们被附加时，就会随着它们所附加的骨骼一起移动。

source: These are simply images that are apart from the animation but when attached will move along with the bone they are attached to.
zh_cn: 这些只是与动画分开的图像，但是当附加时，它们会随着它们所附加的骨骼一起移动。

source: These arguments can be set as an empty string or you can store previously entered values to use if you wish.
zh_cn: 这些参数可以设置为空字符串，也可以存储之前输入的值，以便根据需要使用。

source: These bits can be "masked" and then the rest of the tile data can be used to store additional values.
zh_cn: 这些位可以被"标记(masked)"，然后其余的tile data可以用来存储额外的值。

source: These channels are defined by one of the following constants:
zh_cn: 这些通道由以下常量之一定义:

source: These commands are effectively pre-processed before the game is compiled and so the function can be placed anywhere in your project and it will still be processed before the game is fully compiled.
zh_cn: 这些命令在游戏编译之前就被有效地预处理了，所以函数可以放在项目的任何地方，在游戏完全编译之前它仍然会被处理。

source: These controls are the analogue direction "thumbsticks" on most controllers.
zh_cn: 这些控件是大多数控制器上的模拟方向"拇指操纵杆"。

source: These events can only be called in this way, or using the event_perform function.
zh_cn: 这些事件只能以这种方式调用，或者使用event_perform函数调用。

source: These internal checks cover many aspects of a games code, including ranges, parameters and some general aspects of the internal GML compiler and are what spawn the final error messages in many cases.
zh_cn: 这些内部检查涵盖了游戏代码的许多方面，包括范围、参数和内部GML编译器的一些通用方面，并且在许多情况下是产生最终错误消息的原因。

source: These joints are first anchored in the world space at two points, each one connected to an instance at its center of mass.
zh_cn: 这些关节首先锚定在世界空间的两点上，每一点都与质心的一个实例相连。

source: These keys are assigned on a per room basis and will be automatically removed by GameMaker when changing rooms.
zh_cn: 这些键是按房间分配的，在换房间时会被GameMaker自动移除。

source: These names are defined by the animation program used, or (in the case of the attachment) when you call skeleton_attachment_create().
zh_cn: 这些名称由使用的动画程序定义，或者(在附件的情况下)在调用skeleton_attachment_create()时定义。

source: These names are what you will use to tell GameMaker which animation set to use at any time in your game.
zh_cn: 这些名称将用于告诉GameMaker在游戏中任何时候使用哪个动画集。

source: These should be given in clockwise order, so the first coordinate is the top left, then the top right, then bottom right and finally the bottom left.
zh_cn: 这些应该按顺时针顺序给出，所以第一个坐标是左上角，然后是右上角，然后是右下角，最后是左下角。

source: These skins need to have been previously created and named in your animation program, and this name is passed into the function (as a string) to set the sprite to use that skin when being drawn.
zh_cn: 这些皮肤需要在你的动画程序中已经被创建和命名，并且这个名字被传递到函数中(作为一个字符串)来设置sprite在被绘制时使用那个皮肤。

source: These strings are:
zh_cn: 这些字符串是:

source: These values are often confused, but basically one is the number of game steps that GameMaker is supposed to be completing in a second (game speed), while the other is the number of CPU steps that GameMaker is actually completing in a second (the real fps), and this value is generally much higher than the game speed, but will drop as your game gets more complex and uses more processing power to maintain the set room speed.
zh_cn: 这些值经常被混淆，但基本上一个是GameMaker在一秒钟内应该完成的游戏步骤数(游戏速度)，另一个是GameMaker在一秒钟内实际完成的CPU步骤数(实际fps)，这个值通常比游戏速度高得多，但会随着您的游戏变得更加复杂并使用更多处理能力来维持设定的房间速度而下降。

source: These values are often confused, but basically one is the number of game steps that GameMaker is supposed to be completing in a second, while the other (the fps) is the number of CPU steps that GameMaker is actually completing in a second up to a maximum value of the room speed itself.
zh_cn: 这些值经常被混淆，但基本上一个是GameMaker应该在一秒钟内完成的游戏步骤数，而另一个(fps)是GameMaker在一秒钟内实际完成的CPU步骤数，最高可达房间速度本身的最大值。

source: These values are taken as being between 0 and 255 so you can make 16,777,216 (256*256*256) colours with this!
zh_cn: 这些值在0到255之间，因此您可以用它来制作16，777，216 (256*256*256)种颜色！

source: These values can get then be recovered in the shader to work out which vertex you are dealing with (ie: which corner).
zh_cn: 这些值可以在着色器中恢复，以计算出你正在处理的顶点(即:哪个角)。

source: These values will only be used when the view camera has been assigned an instance target to follow (either in the Room Editor or using the function camera_set_view_target()) and relate to how far from the border of the view the instance needs to be before the view will update its position to follow.
zh_cn: 这些值只会在为视图相机分配了一个要跟随的实例目标(在房间编辑器中或使用camera_set_view_target()函数)时使用，并与视图更新其位置之前实例需要离视图边界多远有关。

source: They can be created with code, or in the Path Editor and they are assigned to an instance to use in the game.
zh_cn: 它们可以用代码创建，或者在路径编辑器中创建，它们被分配给一个实例在游戏中使用。

source: They might be used, for example, to create the surface tension you would see on a drop of water.
zh_cn: 例如，它们可能被用来产生你在一滴水上看到的表面张力。

source: This 1 dimension array is used to get the current value for any alarms that the instance may have, or it can be used to set those alarms.
zh_cn: 这个一维数组用于获取实例可能具有的任何告警的当前值，也可以用于设置这些告警。

source: This DS map index should be stored in a variable and used for all further function calls to this map.
zh_cn: 这个DS map索引应该存储在一个变量中，并用于对该map的所有后续函数调用。

source: This ID can then be used to cancel the notification using the function push_cancel_local_notification().
zh_cn: 这个ID可以使用push_cancel_local_notification()函数来取消通知。

source: This ID should be stored in a variable and used in all further function calls to this buffer.
zh_cn: 这个ID应该存储在一个变量中，并在对该缓冲区的所有后续函数调用中使用。

source: This allows access to the list of asset tracks on the top level of the sequence.
zh_cn: 这允许访问序列顶层的资源轨道列表。

source: This allows access to the message event keyframes for the sequence.
zh_cn: 这允许访问序列的信息事件关键帧。

source: This allows access to the moment event keyframes for the sequence.
zh_cn: 这允许访问序列的瞬间事件关键帧。

source: This also prevents memory leaks and makes sure that you never go over the file limit by having more than 32 files open.
zh_cn: 这还可以防止内存泄漏，并确保打开的文件数量不会超过32个，从而不会超过文件限制。

source: This approach is not guaranteed to work but in most easy cases it will effectively move the instance towards the goal.
zh_cn: 这种方法不能保证有效，但在大多数简单的情况下，它会有效地将实例移向目标。

source: This argument is a string that you can use to tell GameMaker what order the sub-images of the sprite font are and it will map these automatically when writing text.
zh_cn: 这个参数是一个字符串，你可以用它来告诉GameMaker精灵字体的子图像的顺序，当你写文本的时候它会自动映射这些子图像。

source: This array holds the unique camera ID assigned to the given view port, and can be set to a new camera or read to get the current camera, returning -1 if no camera is assigned.
zh_cn: 该数组保存分配给给定视图端口的唯一相机ID，可以将其设置为一个新相机或读取当前相机，如果没有分配相机则返回-1。

source: This asset id can be gotten from the functions sprite_get_texture(), for example (use -1 for no texture).
zh_cn: 例如，这个资源id可以从函数sprite_get_texture()中获得(使用-1表示没有纹理)。

source: This basically says "how much growth do I get after n units of time (and 100% continuous growth)?".
zh_cn: 这基本上是说"在n个单位时间内(100%持续增长)我能获得多少增长?"

source: This built-in variable can be used to either get or set the texture page size when using the function font_add().
zh_cn: 当使用函数font_add()时，这个内置变量可以用来获取或设置纹理页面大小。

source: This built-in variable is created for every instance in a room and contains the layer ID value of the layer that the instance is assigned to.
zh_cn: 该内置变量是为房间中的每个实例创建的，包含实例所分配到的层的层ID值。

source: This built-in variable returns the previous x position for the instance.
zh_cn: 这个内置变量返回实例的前一个x位置。

source: This built-in variable returns the previous y position for the instance.
zh_cn: 这个内置变量返回实例的前一个y位置。

source: This camera is called the default camera and can be set and manipulated (and even destroyed) just like any other camera.
zh_cn: 这个相机被称为默认相机，可以像其他相机一样设置和操作(甚至销毁)。
